---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.SystemsAnalysisWorkfilesRootPath
source: html/1dfd0617-a592-d520-75c7-cccd0734d446.htm
---
# Autodesk.Revit.ApplicationServices.Application.SystemsAnalysisWorkfilesRootPath Property

Root path for systems analysis workfiles

## Syntax (C#)
```csharp
public string SystemsAnalysisWorkfilesRootPath { get; }
```